ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/serial_api.c
    if (tx_status & CY_SCB_TX_INTR_LEVEL) {
        // FIFO has space available for more TX
        uint8_t *ptr = obj_in->tx_buff.buffer;
        ptr += obj_in->tx_buff.pos;
        while ((obj_in->tx_buff.pos < obj_in->tx_buff.length) &&
               Cy_SCB_UART_Put(obj->base, *ptr)) {
            ++ptr;
            ++(obj_in->tx_buff.pos);
        }
        if (obj_in->tx_buff.pos == obj_in->tx_buff.length) {
            // No more bytes to follow; check to see if we need to signal completion.
            if (obj->tx_events & SERIAL_EVENT_TX_COMPLETE) {
                // Disable FIFO interrupt as there are no more bytes to follow.
                Cy_SCB_SetRxInterruptMask(obj->base, CY_SCB_UART_TX_DONE);
            } else {
                // Nothing more to do, mark end of transmission.
                serial_finish_tx_asynch(obj);
            }
        }
    }

    if (tx_status & CY_SCB_TX_INTR_UART_DONE) {
        // Mark end of the transmission.
        serial_finish_tx_asynch(obj);
        cur_events |= SERIAL_EVENT_TX_COMPLETE & obj->tx_events;
    }

    Cy_SCB_ClearTxInterrupt(obj->base, tx_status);

    if (rx_status & CY_SCB_RX_INTR_OVERFLOW) {
        cur_events |= SERIAL_EVENT_RX_OVERRUN_ERROR & obj->rx_events;
    }

    if (rx_status & CY_SCB_RX_INTR_UART_FRAME_ERROR) {
        cur_events |= SERIAL_EVENT_RX_FRAMING_ERROR & obj->rx_events;
    }

    if (rx_status & CY_SCB_RX_INTR_UART_PARITY_ERROR) {
        cur_events |= SERIAL_EVENT_RX_PARITY_ERROR & obj->rx_events;
    }

    if (rx_status & CY_SCB_RX_INTR_LEVEL) {
        uint8_t *ptr = obj_in->rx_buff.buffer;
        ptr += obj_in->rx_buff.pos;
        while (obj_in->rx_buff.pos < obj_in->rx_buff.length) {
            uint32_t c = Cy_SCB_UART_Get(obj->base);
            if (c == CY_SCB_UART_RX_NO_DATA) {
                break;
            }
            *ptr++ = (uint8_t)c;
            ++(obj_in->rx_buff.pos);
            // Check for character match condition.
            if (obj_in->char_match != SERIAL_RESERVED_CHAR_MATCH) {
                if (c == obj_in->char_match) {
                    obj_in->char_found = true;
                    cur_events |= SERIAL_EVENT_RX_CHARACTER_MATCH & obj->rx_events;
                    // Clamp RX.
                    obj_in->rx_buff.length = obj_in->rx_buff.pos;
                    break;
                }
            }
        }
    }

    if (obj_in->rx_buff.pos == obj_in->rx_buff.length) {
        serial_finish_rx_asynch(obj);
    }

    Cy_SCB_ClearRxInterrupt(obj->base, rx_status);

    return cur_events;
}

/** Abort the ongoing TX transaction. It disables the enabled interrupt for TX and
 *  flushes the TX hardware buffer if TX FIFO is used
 *
 * @param obj The serial object
 */
void serial_tx_abort_asynch(serial_t *obj_in)
{
    serial_obj_t *obj = OBJ_P(obj_in);

    serial_finish_tx_asynch(obj);
    Cy_SCB_UART_ClearTxFifo(obj->base);
}

/** Abort the ongoing RX transaction. It disables the enabled interrupt for RX and
 *  flushes the RX hardware buffer if RX FIFO is used
 *
 * @param obj The serial object
 */
void serial_rx_abort_asynch(serial_t *obj_in)
{
    serial_obj_t *obj = OBJ_P(obj_in);

    serial_finish_rx_asynch(obj);
    Cy_SCB_UART_ClearRxFifo(obj->base);
}

#endif // DEVICE_SERIAL_ASYNCH

#endif // DEVICE_SERIAL
